import Footer from '@/components/Footer'
import Header from '@/components/Header'
import { radius } from '@/lib/vars';
import React, { useState } from 'react'
import styled from 'styled-components';

const TextContainer = styled.div`
  h2 {
    text-align: center;
  }
  h4 {
    text-align: center;
  }
  img {
    margin: 0 10px;
  }
  img.first-img {
    float: right;
    width: 300px;
    border-radius: ${radius};
  }
  img.second-img {
    float: left;
    width: 300px;
    border-radius: ${radius};
  }
  ul {
    list-style: none;
    padding: 0;
    li{
      margin: 15px 0;
    }
  }
  @media screen and (max-width: 781px) {
    margin-top: 120px;
    img {
      margin: 10px;
    }
    img.first-img {
    float: right;
    max-width: 100%;
    border-radius: ${radius};
    }
    img.second-img {
      float: left;
      max-width: 100%;
      border-radius: ${radius};
    }
  }
`;

const aboutDellivery = () => {
  return (
    <>
      <Header />
      <main>
        <TextContainer>
        <h2>Доставка та оплата</h2>
        <p>Ми прагнемо зробити процес доставки та оплати наших 
          продуктів максимально зручним та прозорим для наших клієнтів. 
          Нижче наведено основні відомості про доставку та оплату, 
          щоб ви могли з легкістю оформити замовлення та отримати 
          бажані товари.</p>
        <h4>Доставка:</h4>

        <p>
          Ми здійснюємо доставку нашої продукції до всіх регіонів, що виходять з нашого місця розташування.
          Ми співпрацюємо з надійними логістичними партнерами, щоб гарантувати своєчасну та безпечну доставку ваших товарів.
          Терміни доставки можуть змінюватись в залежності від вашого розташування. Ми намагаємося мінімізувати час доставки та інформуємо вас про статус вашого замовлення.
        </p>
        <h4>Вартість доставки:</h4>

        <p>
          Вартість доставки розраховується виходячи з ваги та габаритів товарів, а також вашого розташування.
          Під час оформлення замовлення на нашому сайті ви зможете побачити приблизну вартість доставки перед підтвердженням покупки.
        </p>
        <h4>Оплата:</h4>

        <p>
          Ми пропонуємо різні способи оплати, щоб забезпечити максимальну зручність для наших клієнтів. Виберіть найбільш зручний для вас варіант:
          Оплата банківською карткою: Ми приймаємо основні типи кредитних та дебетових карток.
          Електронні платіжні системи: Ви можете скористатися популярними платіжними системами для безпечної та зручної оплати.
          Готівковий розрахунок при отриманні товару: У деяких випадках ми надаємо можливість оплати готівкою при отриманні замовлення. Подробиці уточнюйте під час оформлення замовлення.
        </p>
        
        </TextContainer>
      </main>
      <Footer />
    </>
  )
}

export default aboutDellivery